_posts_bak/2021-12-31-boj-2533.html
---
layout: post
title: BOJ 2533 사회망 서비스(SNS)
tags: DP dfs Tree
---

<div id="outline-container-orgaca445d" class="outline-2">
<h2 id="orgaca445d">BOJ 2533 사회망 서비스(SNS)</h2>
<div class="outline-text-2" id="text-orgaca445d">
<ul class="org-ul">
<li>tree 구조에서 DP를 적용하는 문제</li>
</ul>
</div>
</div>

<div id="outline-container-orgb9e3342" class="outline-2">
<h2 id="orgb9e3342">접근하기</h2>
<div class="outline-text-2" id="text-orgb9e3342">
<pre class="example">
1. Graph를 인접 리스트로 구성한다 -&gt; Tree가 나옴

2. 1번부터 dfs로 이동한다.

3. 방문한 노드에서 얼리아답터/일반인 일때를 나눠서 dp 배열을 채움

    dp[k][0] : k 노드가 일반인일 때 sub tree에서 얼리아답터 수의 총합
              -&gt; 자식노드가 무조건 얼리아답터여야 한다

    dp[k][1] : k 노드가 얼리아답터일 때 sub tree에서 얼리아답터 수의 총합
              -&gt; 자식 노드가 얼리아답터 or 일반인

4. dfs가 마무리되면, 1번의 dp[1][1], dp[1][0]에
   각각 1번 노드가 일반인/얼리아답터 일 때,  최소 수가 들어있음
   이중 최소값 출력
</pre>
</div>
</div>


<div id="outline-container-org1920660" class="outline-2">
<h2 id="org1920660">코드</h2>
<div class="outline-text-2" id="text-org1920660">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">G</span>[1000010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">done</span>[1000010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[1000010][2];

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">dfs</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>)
{
    dp[num][0] = 0; <span style="color: #888a85;">// </span><span style="color: #888a85;">&#51068;&#48152;&#51064;</span>
    dp[num][1] = 1; <span style="color: #888a85;">// </span><span style="color: #888a85;">&#50620;&#47532;&#50500;&#45813;&#53552;</span>
    done[num] = 1;

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp; <span style="color: #ff6347;">next</span>:G[num]) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (!done[next]) {
            dfs(next);
            <span style="color: #888a85;">// </span><span style="color: #888a85;">&#48512;&#47784;&#44032; &#51068;&#48152; - &#51088;&#49885;&#51008; &#47784;&#46160; &#50620;&#47532;&#50500;&#45813;&#53552;</span>
            dp[num][0] += dp[next][1];
            <span style="color: #888a85;">// </span><span style="color: #888a85;">&#48512;&#47784;&#44032; &#50620;&#47532; - &#51088;&#49885;&#51008; &#50620;&#47532; or &#51068;&#48152;</span>
            dp[num][1] += min(dp[next][0], dp[next][1]);
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>;    
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N-1;i++){
                scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;p1, &amp;p2);
        G[p1].push_back(p2);
        G[p2].push_back(p1);
    }
    dfs(1);

    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, min(dp[1][0], dp[1][1]));
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7dd7f09" class="outline-2">
<h2 id="org7dd7f09">문제 링크</h2>
<div class="outline-text-2" id="text-org7dd7f09">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/2533">https://www.acmicpc.net/problem/2533</a></li>
</ul>
</div>
</div>
